# Parameter Filter Rule Factory Create Not Equals Rule Method

Source: https://www.revitapidocs.com/2026/c3b622c3-1609-9eb7-b3e7-ec13705a24e8.htm

---

| Parameter Filter Rule Factory Create Not Equals Rule Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateNotEqualsRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document do not equal a certain value. |
|  | CreateNotEqualsRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document do not equal a certain value. |
|  | CreateNotEqualsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document do not equal a certain value. |
|  | CreateNotEqualsRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document do not equal a certain value. |

Top See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace